DROP DATABASE library2; 
create database if not exists library2;

USE library2;
CREATE TABLE books2(
id INT PRIMARY KEY AUTO_INCREMENT, 
book_title VARCHAR(120) NOT NULL,
book_description TEXT,
date_of_publication DATE NOT NULL DEFAULT '2018-01-01',
category VARCHAR(60) NOT NULL,
isbn  BIGINT(20) NOT NULL UNIQUE,
number_of_pages SMALLINT NOT NULL,
authors_name VARCHAR(45) NOT NULL,
authors_last_name VARCHAR(45) NOT NULL,
authors_email VARCHAR(50) NOT NULL UNIQUE,
authors_age TINYINT NOT NULL,
authors_date_of_birth DATE NOT NULL,
author_awards VARCHAR(120) 
);

INSERT INTO books2 (book_title, book_description, date_of_publication, category, isbn, number_of_pages, authors_name, authors_last_name, authors_email, authors_age, authors_date_of_birth, author_awards)
VALUES
("Фонд", "НФ", '1951-01-01',"Художні книги",  9786171233560, 224, "Айзек", "Азімов", "asimovguy@asimovonline.com", 72,  '1920-01-02', "Премія Г'юго 1966 за серію «Фундація» (як «Найкращу НФ серію усіх часів»)"),
("Я, Робот", "НФ", '1950-01-01',"Художні книги",  9780007532278, 256 , "Айзек", "Азімов", "asimov@asimovonline.com", 72,  '1920-01-02', "Премія Неб'юла 1976 за повість «Двохсотлітня людина»"),
("Чужинець на чужій землі", "НФ", '1961-01-01',  "Художні книги", 9786171215191, 720, "Роберт Енсон", "Гайнлайн", "Chairman@HeinleinSociety.org", 80, '1907-07-07', "Перший лауреат найпрестижнішої премії фантастики за заслуги перед жанром Гросмейстер фантастики (1975)"),
("Путівник по Галактиці для космотуристів", "НФ", '1979-01-01',  "Художні книги", 9789661043588, 696, "Дуглас", "Адамс", "douglasadams@bbc.co.uk", 49, '1952-03-11', "№ 1 в списку бестселерів Sunday Times (1979)"),
("1984", "Антиутопія", '1949-01-01', "Художні книги", 9789662355574, 312, "Джордж", "Орвелл", "jeremy.wikeley@orwellfoundation.com", 46, '1903-06-25', "Премія Прометей 1984 - зал слави»"),
("Володар перснів", "Фентезі", '1951-01-01', "Художні книги", 7825447105261, 704, "Джон Роналд Руел", "Толкін", "subscribe@harpercollins.co.uk", 81,  '1892-01-03', "1957 - International Fantasy Award в категорії «Художня проза» (Fiction)"),
("Гаррі Поттер", "Фентезі", '1997-06-26', "Художні книги", 9789667047399, 320, "Джоан", "Роулінг", "institute@bloomsbury.com", 54,  '1965-07-31', "Кавалер Ордену Британської імперії (2000)"),
("Дев'ять принців Амбера", "Фентезі", '1970-08-16', "Художні книги", 9789661042802, 280, "Роджер", "Желязни", "RogerJosephZelazny@mail.com", 58,  '1937-05-13', "премії Небюла, премії Х'юго, премії Локус"),
("Керрі", "Містика", '1974-04-05', "Художні книги", 9786171251144, 224, "Стівен", "Кінг", "StephenEdwinKing@gmail.com", 72,  '1947-09-21', "Премія Едгара Алана По (2007)"),
("Сяйво", "Жахи", '1977-01-28', "Художні книги", 9789661462792, 682, "Стівен", "Кінг", "StephenKing@gmail.com", 72,  '1947-09-21', "Премія Едгара Алана По (2007)"),
("Відьмак", "Фентезі", '1990-01-20', "Художні книги", 9786171204980, 288, "Анджей", "Сапковський", "AndrzejSapkowski@gmail.com", 71,  '1948-06-21', "Janusz A. Zajdel Award (1990)"),
("Пісня льоду й полум'я", "Фентезі", '1996-03-21', "Художні книги", 9786175381786, 800, "Джордж", "Мартін", "GeorgeRaymondRichardMartin@gmail.com", 71,  '1948-09-20', "премія «Локус» за найкращий фентезійний роман (2012)"),
("Чорний ворон", "Історичний роман", '2009-12-05', "Художні книги", 9789662151251, 352, "Василь", "Шкляр", "VasylShkliar@gmail.com", 68,  '1951-06-10', "Національна премія України імені Тараса Шевченка (2011)"),
("Записки українського самашедшего", "Проза життя", '2010-12-15', "Художні книги", 9789667047887, 416, "Ліна", "Костенко", "LinaKostenko@gmail.com", 89,  '1930-03-19', "У 2015 році мала планета Сонячної системи № 290127 отримала назву Лінакостенко"),
("Пригоди бравого вояка Швейка", "Cатира", '1921-12-12', "Художні книги", 9789667047719, 736 , "Ярослав", "Гашек", "JaroslavHasek@mail.com", 39,  '1883-04-30', "2734 Гашек — астероїд, названий на честь літератора (1976)"),
("Мандрівник", "Антиутопія", '2005-06-28', "Художні книги", 9663434155, 480 , "Джон", "Твелф Гоукс", "JXIIH@mail.com", 45,  '1974-12-25', DEFAULT),
("Феномен Степана Бандери", "Монографія", '2006-01-01', "Монографія", 9666653397, 736 , "Євген", "Перепічка", "perepichka@gmail.com", 88,  '1931-11-21', DEFAULT),
("Борислав сміється", "Повість присвячена опису страйку", '1882-01-03', "Художні книги", 9786176735731, 232 , "Іван", "Франко", "franko@mail.com", 59,  '1856-08-27', "На честь Івана Франка 1962 року місто Станіслав було перейменовано в Івано-Франківськ"),
("Аналітична економія: макроекономіка і мікроекономіка", "Економіка", '2006-03-21', "Навчальні посібники", 9786176293507, 606, "Степан",  "Панчишин", "zncnan@mail.lviv.ua",  69, '1950-08-18', DEFAULT ),
("Макроекономіка", "Економіка", '1995-09-01', "Навчальні посібники", 9785845915269, 544, "Пол Ентоні",  "Самуельсон", "Samuelson@mit.edu",  94, '1915-05-15',"Лауреат Нобелівської премії з економіки 1970 року"),
("Економіка : монографія", "Економіка", '1993-09-01', "Навчальні посібники", 9785845915270, 495, "Пол Ентоні",  "Самуельсон", "Samuelsonp@mit.edu",  94, '1915-05-15',"Лауреат Нобелівської премії з економіки 1970 року"),
("Мікроекономіка", "Економіка", '1993-09-01', "Навчальні посібники", 9785845915275, 676, "Пол Ентоні",  "Самуельсон", "Samuelsonpol@mit.edu",  94, '1915-05-15',"Лауреат Нобелівської премії з економіки 1970 року"),
("Економічна теорія. Політекономія", "Економіка", '2007-04-08', "Навчальні посібники", 9663110495269, 719, "Віктор", "Базилевич", "office.chief@univ.net.ua", 70, '1949-05-28', "Заслужений діяч науки і техніки України (2005)" ),
("Вивчаємо Java", "Програмування", '2012-01-01', "Навчальні посібники", 9785699545742, 720,  "Кэті", "С'єрра", "KathySierra@mit.edu", 62, '1957-07-31', DEFAULT),
("Філософія Java", "Програмування", '1998-01-01', "Навчальні посібники", 9785459008593, 1168, "Брюс", "Еккель", "BruceEckel@mail.com", 62, '1957-07-08', DEFAULT);

SELECT * FROM books2;
SELECT * FROM books2 WHERE id = 5 or id = 10 or id = 13;
SELECT * FROM books2 WHERE number_of_pages > 150;
SELECT * FROM books2 WHERE authors_age > 30;
SELECT * FROM books2 WHERE author_awards IS NULL;
SELECT * FROM books2 WHERE authors_email = "JaroslavHasek@mail.com";
SELECT * FROM books2 WHERE isbn = 9789662355574;
SELECT * FROM books2 WHERE category = "Художні книги";
SELECT * FROM books2 WHERE number_of_pages > 200 AND authors_age > 25;
SELECT * FROM books2 WHERE category = "Монографія" OR category = "Навчальні посібники";
SELECT * FROM books2 ORDER BY book_title ASC;
SELECT * FROM books2 ORDER BY authors_email ASC;
SELECT * FROM books2 ORDER BY number_of_pages DESC;
SELECT DISTINCT category FROM books2;
SELECT DISTINCT authors_name FROM books2 ORDER BY authors_name ASC;
SELECT * FROM books2 WHERE date_of_publication > '2000-01-01';
SELECT * FROM books2 WHERE date_of_publication < '2010-01-01';
